; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_1 ?v2 - type_2 ?v8 - type_1)
 	      (pred_4 ?v4 - object ?v8 - type_1)
	      (pred_3 ?v2 - type_2 ?v3 - type_3)
	      (pred_2 ?v2 - type_2 ?v4 - object ?v3 - type_3))

   (:action op_2
       :parameters  (?v2 - type_2 ?v1 ?v6 - type_1)
       :precondition (and  (pred_1 ?v2 ?v1))
       :effect (and  (pred_1 ?v2 ?v6)
		     (not (pred_1 ?v2 ?v1))))

   (:action op_1
       :parameters (?v2 - type_2 ?v5 - object ?v7 - type_1 ?v3 - type_3)
       :precondition  (and  (pred_4 ?v5 ?v7) (pred_1 ?v2 ?v7) (pred_3 ?v2 ?v3))
       :effect (and (pred_2 ?v2 ?v5 ?v3)
		    (not (pred_4 ?v5 ?v7)) 
		    (not (pred_3 ?v2 ?v3))))

   (:action op_3
       :parameters (?v2 - type_2 ?v5 - object ?v7 - type_1 ?v3 - type_3)
       :precondition  (and  (pred_2 ?v2 ?v5 ?v3) (pred_1 ?v2 ?v7))
       :effect (and (pred_4 ?v5 ?v7)
		    (pred_3 ?v2 ?v3)
		    (not (pred_2 ?v2 ?v5 ?v3)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_09 obj_11 - type_2
obj_01 obj_04 obj_05 obj_12 - type_3
obj_10 obj_08 obj_02 - type_1
obj_06 obj_03 obj_07 - object)
(:init
(pred_1 obj_09 obj_10)
(pred_3 obj_09 obj_01)
(pred_3 obj_09 obj_04)
(pred_1 obj_11 obj_08)
(pred_3 obj_11 obj_05)
(pred_3 obj_11 obj_12)
(pred_4 obj_06 obj_08)
(pred_4 obj_03 obj_10)
(pred_4 obj_07 obj_10)
)
(:goal
(and
(pred_4 obj_06 obj_10)
(pred_4 obj_03 obj_02)
(pred_4 obj_07 obj_02)
)
)

(:constraints
  (always (not (pred_1 obj_09 obj_02)))
)
)

; plan
1. (op_1 obj_11 obj_06 obj_08 obj_12)
   deleted: (pred_4 obj_06 obj_08) (pred_3 obj_11 obj_12)
   added: (pred_2 obj_11 obj_06 obj_12)
   goals met: 0 of 3
2. (op_1 obj_09 obj_07 obj_10 obj_04)
   deleted: (pred_4 obj_07 obj_10) (pred_3 obj_09 obj_04)
   added: (pred_2 obj_09 obj_07 obj_04)
   goals met: 0 of 3
3. (op_1 obj_09 obj_03 obj_10 obj_01)
   deleted: (pred_4 obj_03 obj_10) (pred_3 obj_09 obj_01)
   added: (pred_2 obj_09 obj_03 obj_01)
   goals met: 0 of 3
4. (op_2 obj_11 obj_08 obj_10)
   deleted: (pred_1 obj_11 obj_08)
   added: (pred_1 obj_11 obj_10)
   goals met: 0 of 3
5. (op_3 obj_11 obj_06 obj_10 obj_12)
   deleted: (pred_2 obj_11 obj_06 obj_12)
   added: (pred_4 obj_06 obj_10) (pred_3 obj_11 obj_12)
   goals met: 1 of 3
6. (op_3 obj_09 obj_07 obj_10 obj_04)
   deleted: (pred_2 obj_09 obj_07 obj_04)
   added: (pred_4 obj_07 obj_10) (pred_3 obj_09 obj_04)
   goals met: 1 of 3
7. (op_1 obj_11 obj_07 obj_10 obj_12)
   deleted: (pred_4 obj_07 obj_10) (pred_3 obj_11 obj_12)
   added: (pred_2 obj_11 obj_07 obj_12)
   goals met: 1 of 3
8. (op_2 obj_11 obj_10 obj_02)
   deleted: (pred_1 obj_11 obj_10)
   added: (pred_1 obj_11 obj_02)
   goals met: 1 of 3
9. (op_3 obj_11 obj_07 obj_02 obj_12)
   deleted: (pred_2 obj_11 obj_07 obj_12)
   added: (pred_4 obj_07 obj_02) (pred_3 obj_11 obj_12)
   goals met: 2 of 3
10. (op_2 obj_11 obj_02 obj_10)
   deleted: (pred_1 obj_11 obj_02)
   added: (pred_1 obj_11 obj_10)
   goals met: 2 of 3
11. (op_3 obj_09 obj_03 obj_10 obj_01)
   deleted: (pred_2 obj_09 obj_03 obj_01)
   added: (pred_4 obj_03 obj_10) (pred_3 obj_09 obj_01)
   goals met: 2 of 3
12. (op_1 obj_11 obj_03 obj_10 obj_12)
   deleted: (pred_4 obj_03 obj_10) (pred_3 obj_11 obj_12)
   added: (pred_2 obj_11 obj_03 obj_12)
   goals met: 2 of 3
13. (op_2 obj_11 obj_10 obj_02)
   deleted: (pred_1 obj_11 obj_10)
   added: (pred_1 obj_11 obj_02)
   goals met: 2 of 3
14. (op_3 obj_11 obj_03 obj_02 obj_12)
   deleted: (pred_2 obj_11 obj_03 obj_12)
   added: (pred_4 obj_03 obj_02) (pred_3 obj_11 obj_12)
   goals met: 3 of 3
